# Connect to the Database

In [2]:
%load_ext sql 

%config SqlMagic.displaylimit = 8

In [3]:
%sql postgresql://postgres:12345@localhost:5432/postgres

Connecting to 'postgresql://postgres:***@localhost:5432/postgres'

In [4]:
%sql SELECT version()

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+-------------------------------------------------------------------------+
|                                 version                                 |
+-------------------------------------------------------------------------+
| PostgreSQL 18.1 on x86_64-windows, compiled by msvc-19.44.35221, 64-bit |
+-------------------------------------------------------------------------+

In [5]:
# set search path
%sql SET search_path TO classicmodels, public

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

++
||
++
++

# IN, NOT IN, ANY Exercises

Practice exercises for using IN, NOT IN, and ANY operators with subqueries.

## สรุปความแตกต่าง

| Operator | ความหมาย | ตัวอย่าง | ผลลัพธ์ |
|---|---|---|---|
| **IN** | ค่าอยู่ในชุด | `price IN (10, 20, 30)` | ถ้า price = 10, 20, หรือ 30 → TRUE |
| **NOT IN** | ค่าไม่อยู่ในชุด | `price NOT IN (10, 20, 30)` | ถ้า price ไม่ใช่ 10, 20, 30 → TRUE |
| **ANY** | เปรียบเทียบกับอย่างน้อย 1 ค่า | `price > ANY (10, 20, 30)` | ถ้า price > 10 ก็ผ่าน (เปรียบเทียบกับค่าต่ำสุด) |
| **ALL** | เปรียบเทียบกับทุกค่า | `price > ALL (10, 20, 30)` | ต้อง price > 30 ถึงผ่าน (เปรียบเทียบกับค่าสูงสุด) |

### ความสัมพันธ์:
- `= ANY` **เหมือนกับ** `IN`
- `<> ALL` **เหมือนกับ** `NOT IN`

---

## Part 1: Using IN

### 1. Find all customers who have had at least one payment
Write a query to find customerName and city for customers whose customerNumber is IN the payments table

>DISTINCT = กำจัดค่าซ้ำ แสดงเฉพาะค่าที่ไม่ซ้ำกัน (unique values)

In [6]:
%%sql

select customerNumber, customerName, city
from customers
where customerNumber in ( SELECT DISTINCT customerNumber
                            FROM payments)

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

98 rows affected.

+----------------+------------------------------+---------------+
| customernumber |         customername         |      city     |
+----------------+------------------------------+---------------+
|      103       |      Atelier graphique       |     Nantes    |
|      112       |      Signal Gift Stores      |   Las Vegas   |
|      114       |  Australian Collectors, Co.  |   Melbourne   |
|      119       |      La Rochelle Gifts       |     Nantes    |
|      121       |      Baane Mini Imports      |    Stavern    |
|      124       | Mini Gifts Distributors Ltd. |   San Rafael  |
|      128       |     Blauer See Auto, Co.     |   Frankfurt   |
|      129       |       Mini Wheels Co.        | San Francisco |
+----------------+------------------------------+---------------+
Truncated to displaylimit of 8.

### 2. List products that have been ordered
Find productName and productLine for all products whose productCode appears IN the orderdetails table

In [7]:
%%sql

select productName, productLine
from products
where productCode in (select distinct productCode 
                        from orderdetails)

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

109 rows affected.

+---------------------------------------+--------------+
|              productname              | productline  |
+---------------------------------------+--------------+
| 1969 Harley Davidson Ultimate Chopper | Motorcycles  |
|        1952 Alpine Renault 1300       | Classic Cars |
|         1996 Moto Guzzi 1100i         | Motorcycles  |
|  2003 Harley-Davidson Eagle Drag Bike | Motorcycles  |
|          1972 Alfa Romeo GTA          | Classic Cars |
|         1962 LanciaA Delta 16V        | Classic Cars |
|           1968 Ford Mustang           | Classic Cars |
|           2001 Ferrari Enzo           | Classic Cars |
+---------------------------------------+--------------+
Truncated to displaylimit of 8.

### 3. Find employees who work in offices located in the USA
Display firstName, lastName, and jobTitle of employees whose officeCode is IN offices with country = 'USA'

In [8]:
%%sql

select employeeNumber, firstName, lastName, jobTitle
from employees
where officeCode in (select distinct officeCode
                        from offices
                        where country ='USA')

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

10 rows affected.

+----------------+-----------+-----------+--------------------+
| employeenumber | firstname |  lastname |      jobtitle      |
+----------------+-----------+-----------+--------------------+
|      1002      |   Diane   |   Murphy  |     President      |
|      1056      |    Mary   | Patterson |      VP Sales      |
|      1076      |    Jeff   |  Firrelli |    VP Marketing    |
|      1143      |  Anthony  |    Bow    | Sales Manager (NA) |
|      1165      |   Leslie  |  Jennings |     Sales Rep      |
|      1166      |   Leslie  |  Thompson |     Sales Rep      |
|      1188      |   Julie   |  Firrelli |     Sales Rep      |
|      1216      |   Steve   | Patterson |     Sales Rep      |
+----------------+-----------+-----------+--------------------+
Truncated to displaylimit of 8.

### 4. Find orders placed by customers from Germany
List orderNumber and orderDate for orders whose customerNumber is IN customers with country = 'Germany'

In [9]:
%%sql

select orderNumber, orderDate
from orders
where customerNumber in (select distinct customerNumber
                            from customers
                            where country ='Germany')

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

7 rows affected.

+-------------+---------------------+
| ordernumber |      orderdate      |
+-------------+---------------------+
|    10101    | 2003-01-09 00:00:00 |
|    10191    | 2003-11-20 00:00:00 |
|    10230    | 2004-03-15 00:00:00 |
|    10296    | 2004-09-15 00:00:00 |
|    10300    | 2003-10-04 00:00:00 |
|    10310    | 2004-10-16 00:00:00 |
|    10323    | 2004-11-05 00:00:00 |
+-------------+---------------------+

## Part 2: Using NOT IN

### 5. Find customers who have never placed an order
List customerName and country for customers whose customerNumber is NOT IN the orders table

In [10]:
%%sql

select customerNumber, customerName, country
from customers
where customerNumber not in (select distinct customerNumber
                            from orders)

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

24 rows affected.

+----------------+----------------------------+-----------+
| customernumber |        customername        |  country  |
+----------------+----------------------------+-----------+
|      125       |     Havel & Zbyszek Co     |   Poland  |
|      168       |   American Souvenirs Inc   |    USA    |
|      169       |     Porto Imports Co.      |  Portugal |
|      206       | Asian Shopping Network, Co | Singapore |
|      223       |            Nat             |  Germany  |
|      237       |       ANG Resellers        |   Spain   |
|      247       |  Messner Shopping Network  |  Germany  |
|      273       |     Franken Gifts, Co      |  Germany  |
+----------------+----------------------------+-----------+
Truncated to displaylimit of 8.

### 6. List products that have never been ordered
Find productName and buyPrice for products whose productCode is NOT IN the orderdetails table

In [11]:
%%sql

select productCode, productName, buyPrice
from products
where productCode not in (select distinct productCode
                            from orderdetails)

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+-------------+-------------------+----------+
| productcode |    productname    | buyprice |
+-------------+-------------------+----------+
|   S18_3233  | 1985 Toyota Supra |  57.01   |
+-------------+-------------------+----------+

### 7. Find employees who are not sales representatives
Display employeeNumber, firstName, and lastName for employees whose jobTitle is NOT IN ('Sales Rep', 'Sales Manager')

In [24]:
%%sql

select employeeNumber, firstName, lastName ,jobTitle
from employees
where jobTitle not in ('Sales Rep', 'Sales Manager')

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

6 rows affected.

+----------------+-----------+-----------+----------------------+
| employeenumber | firstname |  lastname |       jobtitle       |
+----------------+-----------+-----------+----------------------+
|      1002      |   Diane   |   Murphy  |      President       |
|      1056      |    Mary   | Patterson |       VP Sales       |
|      1076      |    Jeff   |  Firrelli |     VP Marketing     |
|      1088      |  William  | Patterson | Sales Manager (APAC) |
|      1102      |   Gerard  |   Bondur  | Sale Manager (EMEA)  |
|      1143      |  Anthony  |    Bow    |  Sales Manager (NA)  |
+----------------+-----------+-----------+----------------------+

### 8. Find product lines that don't have any products priced above $100
List DISTINCT productLine names that are NOT IN the set of productLines with products having buyPrice > 100

In [36]:
%%sql

select distinct productLine
from products
where productLine not in (select distinct productLine
                            from products
                            where buyPrice > 100)

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

6 rows affected.

+------------------+
|   productline    |
+------------------+
| Trucks and Buses |
|      Trains      |
|   Vintage Cars   |
|   Motorcycles    |
|      Planes      |
|      Ships       |
+------------------+

## Part 3: Using ANY

> ANY หมายถึง มากกว่าอย่างน้อย 1 ค่าในชุด

```sql
-- > ANY → มากกว่าอย่างน้อย 1 ค่า
price > ANY (10, 20, 30)  -- price > 10 ก็ผ่าน (เทียบกับค่าต่ำสุด)

-- < ANY → น้อยกว่าอย่างน้อย 1 ค่า  
price < ANY (10, 20, 30)  -- price < 30 ก็ผ่าน (เทียบกับค่าสูงสุด)

-- = ANY → เท่ากับอย่างน้อย 1 ค่า
price = ANY (10, 20, 30)  -- price เท่ากับ 10, 20, หรือ 30 (เหมือน IN)
```

### 9. Find products more expensive than ANY product in the 'Classic Cars' product line
List productName and buyPrice for products with buyPrice greater than ANY product in the 'Classic Cars' productLine. (This will show products more expensive than the cheapest Classic Car)

> แบบนี้คือรวม Classic Cars ที่แพงกว่าตัวถูกสุด

In [48]:
%%sql

select productName, buyPrice
from products
where buyPrice > any (select distinct buyPrice
                        from products
                        where productLine = 'Classic Cars')

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

109 rows affected.

+---------------------------------------+----------+
|              productname              | buyprice |
+---------------------------------------+----------+
| 1969 Harley Davidson Ultimate Chopper |  48.81   |
|        1952 Alpine Renault 1300       |  98.58   |
|         1996 Moto Guzzi 1100i         |  68.99   |
|  2003 Harley-Davidson Eagle Drag Bike |  91.02   |
|          1972 Alfa Romeo GTA          |  85.68   |
|         1962 LanciaA Delta 16V        |  103.42  |
|           1968 Ford Mustang           |  95.34   |
|           2001 Ferrari Enzo           |  95.59   |
+---------------------------------------+----------+
Truncated to displaylimit of 8.

> ไม่รวม Classic Cars เลย

In [42]:
%%sql

select productName, buyPrice
from products
where buyPrice > any (select buyPrice
                        from products
                        where productLine = 'Classic Cars')
AND productLine != 'Classic Cars'

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

72 rows affected.

+---------------------------------------+----------+
|              productname              | buyprice |
+---------------------------------------+----------+
| 1969 Harley Davidson Ultimate Chopper |  48.81   |
|         1996 Moto Guzzi 1100i         |  68.99   |
|  2003 Harley-Davidson Eagle Drag Bike |  91.02   |
|             1958 Setra Bus            |   77.9   |
|            2002 Suzuki XREO           |  66.27   |
|           1957 Chevy Pickup           |   55.7   |
|         1940 Ford Pickup Truck        |  58.33   |
|          1937 Lincoln Berline         |  60.62   |
+---------------------------------------+----------+
Truncated to displaylimit of 8.

### 10. Find customers from countries that have ANY office
Display customerName and country for customers whose country equals ANY country that appears in the offices table

In [44]:
%%sql

select customerName, country
from customers
where country = any (select distinct country
                        from offices)

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

60 rows affected.

+------------------------------+-----------+
|         customername         |  country  |
+------------------------------+-----------+
|      Atelier graphique       |   France  |
|      Signal Gift Stores      |    USA    |
|  Australian Collectors, Co.  | Australia |
|      La Rochelle Gifts       |   France  |
| Mini Gifts Distributors Ltd. |    USA    |
|       Mini Wheels Co.        |    USA    |
|      Land of Toys Inc.       |    USA    |
|    Saveley & Henriot, Co.    |   France  |
+------------------------------+-----------+
Truncated to displaylimit of 8.

### 11. Find products cheaper than ANY 'Planes' product
List productName, productLine, and buyPrice for products with buyPrice less than ANY product in the 'Planes' productLine (excluding Planes themselves)

In [49]:
%%sql

select productName, productLine, buyPrice
from products
where buyPrice < any (select distinct buyPrice
                        from products
                        where productLine = 'Planes')
and productLine != 'Planes'

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

80 rows affected.

+---------------------------------------+------------------+----------+
|              productname              |   productline    | buyprice |
+---------------------------------------+------------------+----------+
| 1969 Harley Davidson Ultimate Chopper |   Motorcycles    |  48.81   |
|         1996 Moto Guzzi 1100i         |   Motorcycles    |  68.99   |
|            2002 Suzuki XREO           |   Motorcycles    |  66.27   |
|           1968 Dodge Charger          |   Classic Cars   |  75.16   |
|        1970 Plymouth Hemi Cuda        |   Classic Cars   |  31.92   |
|           1957 Chevy Pickup           | Trucks and Buses |   55.7   |
|           1969 Dodge Charger          |   Classic Cars   |  58.73   |
|         1940 Ford Pickup Truck        | Trucks and Buses |  58.33   |
+---------------------------------------+------------------+----------+
Truncated to displaylimit of 8.

## Part 4: Advanced - DISTINCT with IN/NOT IN

### 12. Find customers who bought products from multiple distinct product lines
List customerName for customers who have ordered products from at least 3 DISTINCT productLines. 

**Hint:** Use a subquery with COUNT(DISTINCT productLine) and HAVING clause

In [55]:
%%sql

select c.customerName 
from customers c
where customerNumber in (select o.customerNumber
                        from orders o
                        join orderDetails od on o.orderNumber = od.orderNumber
                        join products p on od.productCode = p.productCode
                        group by o.customerNumber
                        having count(distinct p.productLine) >= 3)

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

92 rows affected.

+------------------------------+
|         customername         |
+------------------------------+
|      Atelier graphique       |
|  Australian Collectors, Co.  |
|      La Rochelle Gifts       |
|      Baane Mini Imports      |
| Mini Gifts Distributors Ltd. |
|     Blauer See Auto, Co.     |
|       Mini Wheels Co.        |
|      Land of Toys Inc.       |
+------------------------------+
Truncated to displaylimit of 8.

### 13. Find the distinct cities where we have both customers and offices
List DISTINCT cities that appear in both the customers table and the offices table using IN with a DISTINCT subquery

In [56]:
%%sql

select distinct city
from customers
where city in (select distinct city
                    from offices)

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

5 rows affected.

+---------------+
|      city     |
+---------------+
|     Paris     |
| San Francisco |
|     Boston    |
|     London    |
|      NYC      |
+---------------+

### 14. Find all distinct countries where we have customers but no offices
List DISTINCT country names from customers that are NOT IN the distinct countries from offices table

In [57]:
%%sql

select distinct country
from customers
where country not in (select distinct country
                        from offices)

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

23 rows affected.

+-------------+
|   country   |
+-------------+
|    Spain    |
| Switzerland |
| New Zealand |
|    Italy    |
|    Russia   |
|   Belgium   |
|    Sweden   |
|    Norway   |
+-------------+
Truncated to displaylimit of 8.

### 15. Find employees who manage offices in countries with more than 5 distinct customers
Display firstName, lastName, and city (from offices) for employees whose officeCode is IN offices where the office's country has more than 5 DISTINCT customers.

**Hint:** You'll need multiple subqueries with DISTINCT and GROUP BY

In [58]:
%%sql 

select e.firstName, e.lastName, o.city
from employees e
join offices o on e.officeCode = o.officeCode
where o.officeCode in (select officeCode
                        from offices
                        where country in (select country
                                            from customers
                                            group by country
                                            having count(customerNumber) > 5)
                        )

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

15 rows affected.

+-----------+-----------+---------------+
| firstname |  lastname |      city     |
+-----------+-----------+---------------+
|  Foon Yue |   Tseng   |      NYC      |
|   George  |   Vanauf  |      NYC      |
|   Julie   |  Firrelli |     Boston    |
|   Steve   | Patterson |     Boston    |
|   Diane   |   Murphy  | San Francisco |
|    Mary   | Patterson | San Francisco |
|    Jeff   |  Firrelli | San Francisco |
|  Anthony  |    Bow    | San Francisco |
+-----------+-----------+---------------+
Truncated to displaylimit of 8.